/* ***********************************************************************
								二维数组
二维数组就是在一维数组上，多加一个维度。

二维数组定位方式
二维数组定义的四种方式：
1.数据类型  数组名[行数][列数];
2.数据类型  数组名[行数][列数] = {{数据1，数据2},{数据1，数据2}};
3.数据类型  数组名[行数][列数] = {数据1，数据2，数据3，数据4};
4.数据类型  数组名[	   ][列数] = {数据1，数据2，数据3，数据4};

建议 ： 第二种更加直观 提高代码的可读性
************************************************************************* */

#include <iostream>
using namespace std;
int main()
{
	/*
	//数据类型  数组名[行数][列数]
	int arr[2][3];
	//给二维数组赋值
	 arr[0][0] = 1;
	 arr[0][1] = 2;
	 arr[0][2] = 3;
	 arr[1][0] = 4;
	 arr[1][1] = 5;
	 arr[1][2] = 6;
	 */
	/*
    //2.数据类型  数组名[行数][列数] = {{数据1，数据2},{数据1，数据2}};
	 int arr[2][3] = 
	 {
		 {1,2,3},
	     {4,5,6}
	 };
	 */


	/*
	//3.数据类型  数组名[行数][列数] = { 数据1，数据2，数据3，数据4 };
	int arr[2][3] = { 1,2,3,4,5,6 };
	*/

	//4.数据类型  数组名[	   ][列数] = {数据1，数据2，数据3，数据4};
	int arr[][3] = { 1,2,3,4,5,6 };

	//将二维数组输出
		for (int i = 0; i < 2; i++)
		{
			for (int j = 0; j < 3; j++)
			{
				cout << arr[i][j] << ' ';
			}
			cout << endl;
		}


	system("pause");
	return 0;
}