/* ************************************************************
							函数
作用： 将一段经常使用的代码封装起来，减少重复代码。
函数的定义
1.返回值类型
2.函数名
3.参数列表
4.函数体语句
5.return 表达式 

语法： 返回值类型 函数名 （参数列表）
		{
			函数体语句；
			return表达式
		}
拓展：如果函数不需要返回值，声明的时候可以写void
函数的调用
语法： 函数名（参数）

值传递
作用：函数调用时实参将数值传入给形参
注意：值传递时，函数的形参发生变化，并不会影响到实参

函数的常见样式
1.无参无返
2.有参无返
3.无参有返
4.有参有返

函数的声明
作用：函数的声明可以多次，但是函数的定义只能有一次。

函数的分文件编写（文件包含）
1.创建后缀名为.h的头文件
2.创建后缀名为.cpp的源文件
3.在头文件中写文件的说明
4.在源文件中写函数的定义

**************************************************************** */

//函数定义
int add(int num1, int num2) //num1 num2 只是形式上的参数 ，简称形参。
{
	int sum = num1 + num2;
	return sum;
}

#include <iostream>
using namespace std;
int main()
{
	//a,b 称为实际参数 ，简称实参
	//当调用函数时候，实参的值会传递给形参
	int a = 10;                  //a -> num1
	int b = 20;                 // b -> num2
	int c = add(a, b);           //c = a+b
	cout << add(a,b) << endl;   //a+b
	cout << c << endl;         
	cout << add(c, b) << endl;   // c+b = (a+b)+b

	int sum;
	sum = add(a,b);
	cout << "sum = " << sum << endl;
	system("pause");
	return  0;
}
