/* *****************************************************
                        循环结构
while 循环语句
作用：满足循环条件，执行循环语句。
语法：while(循环条件)
        {
		   循环语句;
		}
只要循环条件的结果为真，就执行循环语句。

******************************************************** */
/*********************************************************
#include <iostream>
using namespace std;
int main()
{
	//输出 0 ~ 9 这10个数字
	int num = 0;
	while (num < 10)
	{
		cout << "num = " << num << endl;
		num++;
	}
	system("pause");
	return 0;
}
********************************************************** */
//while案例练习 猜数字
//系统随机生成一个1-100之间的数字，玩家进行猜测，如果猜错提示玩家数字过大或过小，如果猜对恭喜玩家，并退出。
/*********************************************************************************************************
#include <iostream>
using namespace std;
//系统时间头文件
#include<ctime>
int main()
{
	//添加随机种子，利用当前系统时间生成随机数，防止每次随机数都一样。
	srand((unsigned int)time(NULL));
	//随机生成一个1-100之间的数字
	int num;
	num = rand() % 100 + 1;
	int guss  = 0;
	int cishu = 0;
	while (cishu < 5)
	{
		cout << "输入猜测的数字 ：" << endl;
		cin >> guss;
		if (guss > num) 
		{ 
			cout << "您猜的数大了" << endl;
		}
		else if(guss < num)
		{
			cout << "您猜的数小了" << endl;
		}
		else
		{
			cout << "恭喜您，猜对啦！！" << endl;
			break;//退出当前循环。
		}
		cishu++;

	}
	cout << endl<< "***************GAME OVER！！***************" << endl;
	
	system("pause");
	return 0;1
}
********************************************************************************************************** */





