/* *******************************************************
                            for循环语句
作用：满足循环条件，执行循环语句。
语法：for(起始表达式;条件表达式;末尾表达式)
		{
			循环语句;
		}
******************************************************** */
//案例练习 敲桌子
//输出1~100个数 如果个位数是7或者十位数是7或者是7的倍数输出敲桌子，否则输出原数值。
#include <iostream>
using namespace std;
int main()
{
	//输入数字
	int i;
	for (i = 1; i <= 100; i++)
	{
		int g = i % 10;    //取个位数
		int s = i / 10;    //取十位数
		if (g == 7 || s == 7 || i % 7 == 0)  //判断个位数是7或者十位数是7或者是7的倍数
		{
			cout << "敲桌子" << endl;
		}
		else
		{
			cout << i << endl;
		}
	}
	system("pause");
	return  0;
}



