/* **************************************************************************************
                                       嵌套循环

作用：在循环中再嵌套一层循环，解决一些实际问题。

***************************************************************************************** */

/* **************************************************************************************
#include<iostream>
using namespace std;
int main()
{
	//外层执行1次，内层执行一周
	//外层循环
	for (int i = 0; i < 10; i++)      //输出行 共10行*
	{
		//内层循环
		for (int j = 0; j < 10; j++) //输出列 共10列*
		{
			cout << "* ";
		}
		cout << endl;
	}
	system("pause");
	return 0;
}
************************************************************************************** */

//嵌套案例--乘法口诀表
/* ***********************************************************************************
#include<iostream>
using namespace std;
int main()
{
	for (int i = 1; i <= 9; i++)             //输出9行数
	{

		for (int j = 1; j <= i; j++)         //输出列 列数小于等于行数
		{
			cout << j << "*" << i << "=" << i * j<<"	";
		}
		cout << endl;
	}
	system("pause");
	return 0;
}
*************************************************************************************** */
//输出等腰三角形的 * 

#include <iostream>
using namespace std;
int main()
{
	for (int i = 1; i <= 5; i++)          //输出5行
	{
		for (int j = 0; j < 5 - i; j++)    //先输出空格
		{
			cout << " ";
		}
		for (int j = 0; j < 2 * i - 1; j++)
		{
			cout << "*";
		}
		cout << endl;
	}
	system("pause");
	return 0;
}