/* *******************************************************************
							空指针和野指针

空指针：指针变量指向内存中编号位0的空间
用途：初始化指针变量
注意：空指针指向的内存是不可以访问的

野指针：指针变量指向非法的内容空间
注意：野指针要尽量避免
******************************************************************* */
/*
#include <iostream>
using namespace std;
int main()
{
	//空指针 初始化指针变量
	int *p  = NULL;
	//空指针指向的内存是不可以访问的
	//0~255之间的内存编号是系统占用的，因此不可以直接访问
	
	*p = 10;
	cout << "p = " << *p << endl;
	
	system("pause");
	return 0;
}
*/

#include <iostream>
using namespace std;
int main()
{
	//定义一个指针变量p指向地址编号0x1100的空间
	int *p = (int *)0x1100;
	//访问野指针报错
	cout << *p << endl;
	system("pause");
	return 0;
}