/* *************************************************************************
								    指针
指针的基本概念
作用： 可以通过指针间接访问内存
1.内存编号是从0开始记录的，一般用十六进制数字表示
2.可以利用指针变量保存地址

指针变量的定义和使用
指针变量定义语法 ： 数据类型 *变量名 ;

指针所占内存空间
1.在32位操作系统下，不管是什么类型，指针都是占4个字节空间大小
2.在64位操作系统下，不管是什么类型，指针都是占8个字节空间大小
************************************************************************** */
#include <iostream>
using namespace std;
int main()
{
	//定义变量
	int a = 10;
	//定义指针变量 数据类型 *变量名
	int *p;
	//通过指针访问地址
	p = &a;
	cout << "a的地址为：" << p << endl;
	//通过指针间接访问内存
	cout << "p = " << *p << endl;
	//通过指针间接改变内存
	*p = 20;
	cout << "a = " << a << endl;

	cout << "32位指针所占内存大小：" << sizeof(int *) << endl;
	cout << "32位指针所占内存大小：" << sizeof(double *) << endl;

	system("pause");
	return 0;
}
