//关键字
//关键字是系统已经预定义的 ，不能再用来定义为其他类型。

//标识符
//标识符是由若干个字符组成的字符序列，可用作常量名、变量名、函数名、和类名等。

//标识符命名规则
//1.标识符不可以是关键字。
//2.标识符由字母、数字、下划线构成。
//3.标识符第一个字符只能是字母或下划线。
//4.标识符区分大小写。
//建议：给标识符取名能够做到见名知意。

#include <iostream>
using namespace std;
int main()
{
	/* ***********************************************
	int int = 10;  报错原因：标识符不可以是关键字。
	
	int abc = 1;
	int _ab = 1;
	int 123 = 1; 报错原因：标识符第一个字符只能是字母或下划线。
	
	int aaa = 10;
	cout << AAA << endl;  报错原因：标识符区分大小写，aaa和AAA不是同一个名称
	
	************************************************ */
	int num1 = 10;
	int num2 = 20;
	int sum;
	sum = num1 + num2;
	cout << sum << endl;
	system("pause");
	return 0;
}