/* ***********************************************************************
							 运算符
作用：用于执行代码的运算

					       逻辑运算符
作用：用于根据表达式的值返回一个真值或价假值。
包括：&&（与）、||（或）、!(非)

与(&&)：是双目运算符，对于 a&&b ，当且仅当a和b都为真时，结果为真，否则为假（有一个是假就是假）
或(||)；是双目运算符，对于 a||b , 当且仅当a和b都为假时，结果为假，否则为真（有一个是真就是真）
非(!): 是单目运算符，目的是将操作数的逻辑值取反，即真(1)->假(0)；假(0)->真(1)

************************************************************************* */
#include<iostream>
using namespace std;
int main()
{
	int num = 10;
	int num1 = 20;
	int num2 = 0;
	int num3 = 0;
	
	cout << "逻辑运算符 与（&&）" << endl;
	//逻辑运算符 与（&&）
	cout << (num && num1) << endl; 
	cout << (num && num2) << endl;
	cout << (num2 && num3) << endl<< endl;
	// 八字真言：同真为真，其余为假。
	
	cout << "逻辑运算符 或（||）" << endl;
	//逻辑运算符 或（||）
	cout << (num || num1) << endl;
	cout << (num || num2) << endl;
	cout << (num2 || num3) << endl<< endl;
	//八字真言：同假为假，其余为真。
	
	cout << "逻辑运算符 非（!）" << endl;
	//逻辑运算符 非（!）
	//C++中所有的非零数都是真（1）
	cout << !num << endl;  //结果为假（0），因为10为真（1）
	cout << !!num << endl<< endl; //结果为真（1），双重否定表肯定

	system("pause");
	return 0;
}