/* *********************************************************
                       程序控制流程
	C/C++支持最基本的三种程序运行结构：
	1.顺序结构
	程序按顺序执行，不发生跳转
	2.选择（分支）结构
	依据条件是否满足，有选择的执行相应功能
	3.循环结构
	依据条件是否满足，循环多次执行某段代码

选择结构
	if语句
	作用：执行满足条件的语句。
	
	if语句的三种形式：
	1.单行格式if语句
	语法： 
	if (条件)
	{
	  条件满足执行的语句
	}
	注意： if条件后面不要加分号（否则将不会判断if里的条件）
	
	2.多行格式if语句
	语法：
	if(条件)
	{
	  条件满足执行的语句
	}
	else
	{
	  条件不满足执行语句
	}
	
	3.多条件的if语句
	语法：
	if(条件1)
	{
	  条件1满足执行的语句
	}
	****条件1成立时将不再进行后边的运行****
	else if(条件2)
	{
	  条件2满足执行的语句
	}
	.....
	else
	{
	  都不满足执行的语句
	}

	嵌套if语句
	在if语句中，可以嵌套使用if语句，达到更精确的条件判断

*********************************************************** */
#include <iostream>
using namespace std;
int main()
{
	//选择结构--if语句
	//例子--用户输入分数，如果分数大于700分，考上了重点大学，并恭喜，
	//                            大于710分
	//                            大于720分
	//                    如果分数大于600分，考上了一本大学，并恭喜，
	//                    如果分数大于400分，考上了二本大学，并恭喜，
	//                    小于等于400分，请您复读吧！！，
	
	//用户输入分数
	int score;
	cout << "请输入您的高考成绩：" ;   
	cin >> score;           
	 
	//判断score大于700 则输出大括号内的内容
	if (score > 700)
	{
		    cout << "********恭喜您考上了重点大学********" << endl;
		if (score > 710 && score < 720)
		{
			cout << "********您能考入北京大学********" << endl;
		}
		else if (score > 720)
		{
			cout << "********您能考入清华大学********" << endl;
		}
		else 
		{
			cout << "********您能考入985大学********" << endl;
		}
	}
	//判断score大于600 则输出else if后的大括号内的内容
	else if (score > 600)
	{
		cout << "********恭喜您考上了一本大学********" << endl;
	}
	//判断score大于400 则输出else if后的大括号内的内容
	else if (score > 400)
	{
		cout << "********恭喜您考上了二本大学********" << endl;
	}
	//其他情况（score<=400） 则输出else后的大括号内的内容
	else
	{
		cout << "********少壮不努力 老大徒伤悲 复读吧少年！！********" << endl;
	}

	system("pause");
	return 0;
}