/* *********************************************************************************
选择结构练习案例
1.三只小猪称体重
2.输入任意两个整数，如果第一个数的值比第二个数大，就将它们的值交换后输出。
3.输入三个数，将他们按从小到大的顺序输出。
4.				1	x > 0	
   已知函数	y = 0	x = 0  ,  任意给定自变量x的值，求函数y的值。
				-1	x < 0
********************************************************************************** */

//1.三只小猪称体重
/* *********************************************************************************
#include <iostream>
using namespace std;
int main()
{
	int A, B, C;
	cout << "请输入小猪A的体重：";
	cin >> A;
	cout << endl <<"请输入小猪B的体重：";
	cin >> B;
	cout << endl <<"请输入小猪C的体重：";
	cin >> C;
	if (A > B)
	{
		if (A > C)
		{
			cout << "小猪A最沉" << endl;
		}
		else
		{
			cout << "小猪C最沉" << endl;
		}
	}
	else if(A < B)
	{
		if (C < B)
		{
			cout << "小猪B最沉" << endl;
		}
		else
		{
			cout << "小猪C最沉" << endl;
		}
	}


	system("pause");
	return 0;
}
************************************************************************************* */

//2.输入任意两个整数，如果第一个数的值比第二个数大，就将它们的值交换后输出
/* *************************************************************************************
#include <iostream>
using namespace std;
int main()
{
	//输入任意的两个数
	int num1, num2,temp;
	cout << "请输入数值 num1 = ";
	cin >> num1;
	cout << "请输入数值 num2 = ";
	cin >> num2;
	//判断条件并交换数值
	if (num1 > num2)
	{
		temp = num1;
		num1 = num2;
		num2 = temp;
		cout << "num1 = " << num1 << endl;
		cout << "num2 = " << num2 << endl;
	}
	system("pause");
	return 0;
}
****************************************************************************************** */

//3.输入三个数，将他们按从小到大的顺序输出。
/* *****************************************************************************************
#include <iostream>
using namespace std;
int main()
{
	//输入三个数
	int a, b, c;
	cout << "请输入 a = ";
	cin >> a;
	cout << "请输入 b = ";
	cin >> b;
	cout << "请输入 c = ";
	cin >> c;

	//判断并排序
	int t;
	if (a > b)
	{              
		t = a;    
		a = b;    //a = 4  ,  b = 5
		b = t;
	}
    if (a > c)
	{
		t = a;
		a = c;    //a = 3 , c = 4
		c = t;
	}
    if (b > c)
	{
		t = b;
		b = c;     //b = 4 , c = 5
		c = t;
	}

	cout << "从小到大排序后 = " << a << b << c << endl;

	system("pause");
	return 0;
}
*********************************************************************************************** */

//4.求函数
/* **********************************************************************************************
#include <iostream>
using namespace std;
int main()
{
	//输入自变量x
	float x,y;
	cout << "请输入 x = ";
	cin >> x;
	if (x > 0)
	{
		y = 1;
		cout << "y = " << y << endl;
	}
	else if (x == 0)
	{
		y = 0;
		cout << "y = " << y << endl;
	}
	else if (x < 0)
	{
		y = -1;
		cout << "y = " << y << endl;
	}

	system("pause");
	return 0;

}
************************************************************************************************** */



